{"modelTopology":{"class_name":"Sequential","config":{"name":"player","layers":[{"class_name":"Conv2D","config":{"filters":4,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true,"batch_input_shape":[null,50,50,9],"dtype":"float32"}},{"class_name":"AveragePooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"AveragePooling2D","config":{"pool_size":[5,5],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D2","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":25,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}]},"keras_version":"tfjs-layers 4.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,9,4],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[4],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[5,5,4,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[21904,25],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[25],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[25,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.1.0","convertedBy":null}