{"modelTopology":{"class_name":"Sequential","config":{"name":"bot","layers":[{"class_name":"Conv2D","config":{"filters":11,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"analyzeCells1","trainable":true,"batch_input_shape":[null,50,50,11],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Conv2D","config":{"filters":11,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"analyzeCells2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[5,5],"padding":"same","strides":[5,5],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout7","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 4.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"analyzeCells1/kernel","shape":[1,1,11,11],"dtype":"float32"},{"name":"analyzeCells1/bias","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[11],"dtype":"float32"},{"name":"analyzeCells2/kernel","shape":[1,1,11,11],"dtype":"float32"},{"name":"analyzeCells2/bias","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[11],"dtype":"float32"},{"name":"c1/kernel","shape":[3,3,11,8],"dtype":"float32"},{"name":"c1/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[8],"dtype":"float32"},{"name":"c2/kernel","shape":[3,3,8,16],"dtype":"float32"},{"name":"c2/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[16],"dtype":"float32"},{"name":"c3/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"c3/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[800,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[11],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[32],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.1.0","convertedBy":null}