{"modelTopology":{"class_name":"Sequential","config":{"name":"bot","layers":[{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c1","trainable":true,"batch_input_shape":[null,50,50,9],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true}},{"class_name":"AveragePooling2D","config":{"pool_size":[5,5],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true}},{"class_name":"AveragePooling2D","config":{"pool_size":[4,4],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D2","trainable":true}},{"class_name":"Conv2D","config":{"filters":38,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"c3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}}]},"keras_version":"tfjs-layers 4.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"c1/kernel","shape":[3,3,9,8],"dtype":"float32"},{"name":"c1/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[8],"dtype":"float32"},{"name":"c2/kernel","shape":[3,3,8,32],"dtype":"float32"},{"name":"c2/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[32],"dtype":"float32"},{"name":"c3/kernel","shape":[5,5,32,38],"dtype":"float32"},{"name":"c3/bias","shape":[38],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[38],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[38],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[950,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[38],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[38],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.1.0","convertedBy":null}